#GUI (Graphic User Interface)
#그래픽을 통해 사용자와 컴퓨터가 상호 작용하는 방식
#CLI (Command Line Interface)
#명령어를 통해 사용자와 컴퓨터가 상호 작용하는 방식
#GUI는 CLI에 비해 사용하기 쉽지만 단계가 많고 컴퓨터의 성능을 더많이 소모
#수많은 서버/ 개발 시스템이 CLI를 통한 조작 환경을 제공
#


#CLI기본적인 명령어
#touch
#파일을 생성하는 명령어
#Mkdir (make diretory)
#새폴더를 생성하는 명령어
#lS
#  현재 작업중인 디렉토리 폴더/ 파일 목록을 보여주는 명령어
#cd (change diretory)
#start, open
#rm (remove)


#절대경로
#루트디렉토리부터 목적 지점까지 거치는 모든 경로를 전부 작성한 것
#윈도우에서 바탕화면의 절대경로 C:/Users/ssafy/Desktop
#상대경로
#현재 작업하고 있는 디렉토리를 기준으로 계산된 상대적 위치를 작성한것
#현재위치 C:/Users 
#./: 현재 작업하고있는 폴더  ../: 상위 디렉토리


#마크다운(markdown)
#텍스트 기반의 가벼운 마크업 언어
#문서의 구조와 내용을 같이적고 쉽게하기위해
#
#github 문서의 시작과 긑
#REDME.md 파일을 통해 오픈소스의 공식문서 작성
#개인 프로젝트의 소개문서 작성
#매일 학습한 내용정리
#마크다운을 이요한 블로그 운영
#개발문서의 시작과 끝
#
#Typora
#실시간 마크다운 변환(미리보기) 제공
#이미지 또는 표삽입시 매우 편한 ui 제공
#VS Code등의 프로그램도 마크다운을 지원하지만 
#전용 프로그램을 사용하면 더편하게 사용가능

# # 헤딩(#)
# 문서의 제목이나 소제목으로 사용해요
# #의 개수에 따라 제목의 수준을 구별 (h1~h6)

# 리스트(List)
# 순서가 있는 리스트 (1.) 없는 리스트 (*)(-)
#목록을 표시하기 위해서 사용한다.

#코드블럭 ```code block```` 'inline code block'
#일반 텍스트와 다르게 코드를 이쁘게 출력해요
# ``` ` =  1 옆의 물결표버튼

#  [string](url) string은 보여지는 부분 url은 연결할곳 []
# 링크를 클릭하고 싶으면 컨트롤 우클릭

#![string](img_url)
#   이미지(image)
#링크와 비슷하지만 이미지를 삽입합니다
#이미지의 너비와 높이는 조절할수 없어요
#조절이 필요하다면 HTML사용해야해요

#**Bold** *italic* ~~strikcout~~
# 텍스트 강조()
#순서대로 굵게 기울이기 취소선
# * 을 _ 로 대체가능
#취소선은 프로그램에 따라

# --- 
# 수평선 
# 가로로 긴 수평선을 작성합니다
# 대개 단락을 나눌때 사용
# - 을 * 나 _ 로 대체 가능
# 3개 이상이면 똑같이 동작

#https://www.markdownguide.org/cheat-sheet/